           Select Sis-File assign to external sistema
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS SIS-CODIGO
               FILE STATUS IS WS-FILE-STATUS.
